notebook/blog-2008-01-29-1318.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Boole's "Laws of Thought"</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:52 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content="Boole's "Laws of Thought""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Boole's "Laws of Thought"</h1>

<p>I've been in the mood to dig a bit deeper into the past of mathematics
and logic and philosophy. So I've taken a break from the early
twentieth-century Russell and Wittgenstein to take a look at the
origins of pure mathematics and logic&mdash;in George Boole's 1854
treatise "An Investigation of the Laws of Thought, On Which are
Founded the Mathematical Theories of Logic and Probabilities."
</p>
<p>
A <a href="http://www.gutenberg.org/etext/15114">fully TeXed</a> version is available free of charge from the Gutenberg
Project.
</p>
<p>
It's exciting to read the genesis of Boolean logic here:
</p>
<pre class="example">
"... instead of determining the measure of formal agreement of the
symbols of Logic with those of Number generally, it is more
immediately suggested to us to compare them with symbols of quantity
admitting only of the values 0 and 1. Let us conceive, then, of an
Algebra in which the symbols x, y, z etc. admit indifferently of the
values 0 and 1, and of these values alone."
</pre>


<ul>
<li>from Chapter 2, "Signs and their Laws"
</li>
</ul>


<p>
Fascinating stuff. 
</p></div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:52 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
